function ctrQuests($scope) {
  // var quests = {
  //   q4: {
  //     name: 'Принести артефакт',
  //     desc: 'Найти и принести артефакт "Медуза"',
  //     state: 0      
  //   },
  //   q3: {
  //     name: 'Убить стрелка',
  //     desc: 'Найти и убить стлкера по имени Стрелок',
  //     state: 0
  //   },
  //   q2: {
  //     name: 'Принести артефакт',
  //     desc: 'Найти и принести артефакт "Улитка"',
  //     state: 1      
  //   },
  //   q1: {
  //     name: 'Принести артефакт',
  //     desc: 'Найти и принести артефакт "Спираль"',
  //     state: 2      
  //   },
  // };

  $scope.available = [{
    uid: 4,
    name: 'Принести артефакт',
    desc: 'Найти и принести артефакт "Медуза"'
  },{
    uid: 3,
    name: 'Убить стрелка',
    desc: 'Найти и убить стлкера по имени Стрелок'
  }];

  $scope.active = [{
    uid: 2,
    name: 'Принести артефакт',
    desc: 'Найти и принести артефакт "Улитка"'
  }];

  $scope.closed = [{
    uid: 1,
    name: 'Принести артефакт',
    desc: 'Найти и принести артефакт "Спираль"'
  }];


  $scope.activate = function(quest) {
    
  }
  $scope.remove = function(quest) {
    
  }
}
